<template>
  <p>வணக்கம்</p>
</template>
<script setup lang="ts">
import { எண்களைப்_பயன்படுத்து, மொழிகளைப்_பயன்படுத்து } from "@/குறியீட்டு";
import {inject, ref} from "vue";

const எண்ணிக்கை = inject("எண்ணிக்கை")!;

const {
  தேர்ந்தெடுத்தப்பட்ட_எண்ணுரு,
  எண்ணுரு,
  எண்ணுரு_முறைமைகள்,
  எண்ணை_வடிவூட்டு,
  எண்_எழுத்து_வடிவூட்டு,
  பதிப்பை_வடிவூட்டு
} = எண்களைப்_பயன்படுத்து();

const {
  மொழிகளை_தேர்ந்தெடுக்கொள்ளு
} = மொழிகளைப்_பயன்படுத்து();

const வடிவூட்டப்பட்ட_எண் = எண்ணை_வடிவூட்டு(123)
const வடிவூட்டப்பட்ட_எண்_எழுத்து = எண்_எழுத்து_வடிவூட்டு("+(91) 23456-78901")
const வடிவூட்டப்பட்ட_பதிப்பு = பதிப்பை_வடிவூட்டு("1.20.1")
</script>