<template>
<p></p>
</template>
<script setup lang="ts">
import {கிளிமூக்கை_பயன்படுத்து} from "@/குறியீட்டு";
import {inject, ref} from "vue";

const கிளிமூக்கு = inject("கிளிமூக்கு");

const {
  கிடைக்கும்_மொழிகளை_பயன்படுத்து,
  மொழி_முன்னேற்றத்தை_பயன்படுத்து,
  சாபிகளை_பயன்படுத்து,
  பரிந்துரைகளை_பயன்படுத்து,
  மொழிபெயர்ப்புகளை_பயன்படுத்து,
  மொழியாக்கம்_பயன்படுத்து,
} = கிளிமூக்கை_பயன்படுத்து();

const {
    கிடைக்கும்_மொழி_குறியீடுகள்,
    மொழிகளும்_குறியீடுகளும்,
    மொழியின்_பெயர்,
  } = கிடைக்கும்_மொழிகளை_பயன்படுத்து({})

const மொழி_பெயர் = மொழியின்_பெயர்("ಕ")

const {மொழி_முன்னேற்றம்} = மொழி_முன்னேற்றத்தை_பயன்படுத்து({மொழி: "த"})

const {சாபிகள்} = சாபிகளை_பயன்படுத்து({})

const {பரிந்துரைகள்} = பரிந்துரைகளை_பயன்படுத்து({});
const {அங்கீகரிக்கப்பட்ட_மொழிபெயர்ப்புகள்} = மொழிபெயர்ப்புகளை_பயன்படுத்து({});
const {மொ} = மொழியாக்கம்_பயன்படுத்து({});

const தலைப்பு = மொ("விண்மீன்.பெயர்")
</script>