<template>
  <p />
</template>
<script setup lang="ts">
import { மொழிகளைப்_பயன்படுத்து } from "@/குறியீட்டு";
import {inject, ref} from "vue";

const nuchabäl = inject("nuch'ab'äl")!;

const {
    மொழி,
    மாற்றுமொழிகள்,
    மொழிகளை_தேர்ந்தெடுக்கொள்ளு,
    அகராதியிலிருந்து_மொழிபெயர்ப்பு,
    வலதிலிருந்து_இடது_மொழி,
  } = மொழிகளைப்_பயன்படுத்து();

const மொழி_திசை = வலதிலிருந்து_இடது_மொழி()
const பார்சிகம்_திசை = வலதிலிருந்து_இடது_மொழி("فا")

const அகராதி = ref({fr: "kilimukku", த: "கிளிமூக்கு"})
const பெயர் = அகராதியிலிருந்து_மொழிபெயர்ப்பு(அகராதி)
</script>