import { beforeEach, describe, test } from "vitest";
import { mount } from "@vue/test-utils";
import { எண்களை_உருவாக்கு, எண்களைப்_பயன்படுத்து, மொழிகளைப்_பயன்படுத்து } from "@/குறியீட்டு.js";

import { defineComponent } from "vue";

const சோதனை_கூற்றை_பெறு = () => {
  window.localStorage.clear();
  return defineComponent({
    setup() {
      const மாறிகள் = {
        ...எண்களைப்_பயன்படுத்து(),
        ...மொழிகளைப்_பயன்படுத்து(),
      };
      const வடிவூட்டப்பட்ட_எண் = மாறிகள்.எண்ணை_வடிவூட்டு(123);
      const வடிவூட்டப்பட்ட_எண்_எழுத்து = மாறிகள்.எண்_எழுத்து_வடிவூட்டு("+(91) 23456-78901")
      const வடிவூட்டப்பட்ட_பதிப்பு = மாறிகள்.பதிப்பை_வடிவூட்டு("1.20.1")
      return {
        ...மாறிகள்,
        வடிவூட்டப்பட்ட_எண்,
        வடிவூட்டப்பட்ட_எண்_எழுத்து,
        வடிவூட்டப்பட்ட_பதிப்பு,
      }
    },
    render() {
      return "";
    },
  });
}

describe("எண்கள்", function () {
  let உறை: ReturnType<typeof mount<ReturnType<typeof சோதனை_கூற்றை_பெறு>>>;
  beforeEach(() => {
    உறை = mount(சோதனை_கூற்றை_பெறு(), {
      global: {
        plugins: [
          எண்களை_உருவாக்கு({
            மொழி: "fr",
          }),
        ],
      },
    });
  });
  test("எண்ணிக்கை கிடைக்கும்", async ({ expect }) => {
   // expect(உறை.vm.எண்ணிக்கை).not.toBeUndefined();
  });
  test("தேர்ந்தெடுத்தப்பட்ட எண்ணுரு", async ({ expect }) => {
    expect(உறை.vm.தேர்ந்தெடுத்தப்பட்ட_எண்ணுரு).toBeUndefined();
    expect(உறை.vm.எண்ணுரு).toBe("latin");
  });
  test("மொழியின் மாற்றம்", async ({ expect }) => {
    உறை.vm.தேர்ந்தெடுத்தப்பட்ட_எண்ணுரு = undefined;
    உறை.vm.மொழிகளை_தேர்ந்தெடுக்கொள்ளு("ಕ");
    await new Promise((résoudre) => setTimeout(résoudre, 10));
    expect(உறை.vm.எண்ணுரு).toBe("ಕನ್ನಡ");
  });
  test("தேர்ந்தெடுத்தப்பட்ட எண்ணுரு", async ({ expect }) => {
    உறை.vm.தேர்ந்தெடுத்தப்பட்ட_எண்ணுரு = "தமிழ்";
    expect(உறை.vm.எண்ணுரு).toBe("தமிழ்");
  });
  test("எண்ணுரு_முறைமைகள்", async ({ expect }) => {
    expect(Array.isArray(உறை.vm.எண்ணுரு_முறைமைகள்)).toBe(true);
  });
  test("எண்ணை வடிவூட்டு", async ({ expect }) => {
    உறை.vm.தேர்ந்தெடுத்தப்பட்ட_எண்ணுரு = "latin";
    expect(உறை.vm.வடிவூட்டப்பட்ட_எண்).toBe("123");
    உறை.vm.தேர்ந்தெடுத்தப்பட்ட_எண்ணுரு = "ಕನ್ನಡ";
    expect(உறை.vm.வடிவூட்டப்பட்ட_எண்).toBe("೧೨೩");
  });
  test("எண் எழுத்து வடிவூட்டு", async ({ expect }) => {
    உறை.vm.தேர்ந்தெடுத்தப்பட்ட_எண்ணுரு = "latin";
    expect(உறை.vm.வடிவூட்டப்பட்ட_எண்_எழுத்து).toBe("+(91) 23456-78901");
    உறை.vm.தேர்ந்தெடுத்தப்பட்ட_எண்ணுரு = "ಕನ್ನಡ";
    expect(உறை.vm.வடிவூட்டப்பட்ட_எண்_எழுத்து).toBe("+(೯೧) ೨೩೪೫೬-೭೮೯೦೧");
  });
  test("பதிப்பை வடிவூட்டு", async ({ expect }) => {
    உறை.vm.தேர்ந்தெடுத்தப்பட்ட_எண்ணுரு = "latin";
    expect(உறை.vm.வடிவூட்டப்பட்ட_பதிப்பு).toBe("1.20.1");
    உறை.vm.தேர்ந்தெடுத்தப்பட்ட_எண்ணுரு = "ಕನ್ನಡ";
    expect(உறை.vm.வடிவூட்டப்பட்ட_பதிப்பு).toBe("೧.೨೦.೧");
  });
});
